tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
        if (attempt < WIFI_INFO_NOTIFY_RETRY_COUNT) {
            ESP_LOGW(TAG, "wifi_info_result send failed ip=%s attempt=%d, retry",
                     ip_str,
                     attempt);
            vTaskDelay(pdMS_TO_TICKS(WIFI_INFO_NOTIFY_RETRY_DELAY_MS));
        }
    }

    ESP_LOGE(TAG, "wifi_info_result send failed ip=%s attempts=%d",
             ip_str,
             WIFI_INFO_NOTIFY_RETRY_COUNT);
    return false;
}

void send_base_info_to_mobile_old(void)
{
        char ip_str[sizeof("255.255.255.255")];
        char json_str[384];
        const esp_app_desc_t *app = esp_app_get_description();
        const esp_partition_t *running = esp_ota_get_running_partition();

        esp_netif_ip_info_t ip = {};
        esp_netif_t *esp_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
        if (esp_netif != NULL &&
            esp_netif_get_ip_info(esp_netif, &ip) == ESP_OK &&
            ip.ip.addr != 0) {
            net_connect_OK =1;
            working_time = 0;
            snprintf(ip_str, sizeof(ip_str), IPSTR, IP2STR(&ip.ip));
            snprintf(json_str, sizeof(json_str),
                     "{\"func\":\"wifi_info_result\",\"result\":%d,\"message\":\"wifi info\",\"stage\":\"%s\","
                     "\"project\":\"%s\","
                     "\"version\":\"%s\","
                     "\"date\":\"%s\","
                     "\"time\":\"%s\","
                     "\"idf\":\"%s\","
                     "\"running\":\"%s\"}",
                     TDX_JSON_RESULT_OK,
                     ip_str,
                     app != NULL ? app->project_name : "",
                     app != NULL ? app->version : "",
                     app != NULL ? app->date : "",
                     app != NULL ? app->time : "",
                     app != NULL ? app->idf_ver : "",
                     running != NULL ? running->label : "");
            #if(USER_BLE_ENABLE == 1)
             (void)s_active_send_json(json_str);
             UserDebugOutput_Printf("JSON:\n%s\n", json_str);
            #else
             (void)s_active_send_json(json_str);
            #endif

            //UserDebugOutput_Printf("  ETHIP: " IPSTR "\r\n", IP2STR(&ip.ip));
            //UserDebugOutput_Printf("  ETHMASK: " IPSTR "\r\n", IP2STR(&ip.netmask));
            //UserDebugOutput_Printf("  ETHGW: " IPSTR "\r\n", IP2STR(&ip.gw));

        }
}

static bool is_valid_wifi_text(const char *text, size_t max_len)
{
    size_t len = 0;

    if (text == NULL || text[0] == '\0') {
        return false;
    }
    len = strlen(text);
    return len > 0 && len < max_len;
}

static esp_err_t save_wifi_config_to_nvs(const char *ssid, const char *password)
{
    nvs_handle_t handle = 0;

    if (!is_valid_wifi_text(ssid, 33) || password == NULL || strlen(password) >= 65) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t ret = nvs_open("nvs.net80211", NVS_READWRITE, &handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "open nvs.net80211 failed: %s", esp_err_to_name(ret));
        return ret;
    }

    ret = nvs_set_blob(handle, "sta.ssid", ssid, strlen(ssid) + 1);
    if (ret == ESP_OK) {
        ret = nvs_set_blob(handle, "sta.pswd", password, strlen(password) + 1);
    }
    if (ret == ESP_OK) {
        ret = nvs_commit(handle);
    }
    nvs_close(handle);

    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "WiFi config save failed ret=%s", esp_err_to_name(ret));
    }
    return ret;
}

class SsidManager {
public:
    static SsidManager& GetInstance()
    {
        static SsidManager instance;
        return instance;
    }

    void Clear()
    {
        nvs_handle_t nvs_handle = 0;
        esp_err_t ret = nvs_open("wifi", NVS_READWRITE, &nvs_handle);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "SsidManager Clear open wifi failed: %s", esp_err_to_name(ret));
            return;
        }

        for (int i = 0; i < 10; i++) {
            char ssid_key[16];
            char password_key[16];
            if (i == 0) {
                snprintf(ssid_key, sizeof(ssid_key), "ssid");
                snprintf(password_key, sizeof(password_key), "password");
            } else {
                snprintf(ssid_key, sizeof(ssid_key), "ssid%d", i);
                snprintf(password_key, sizeof(password_key), "password%d", i);
            }
            (void)nvs_erase_key(nvs_handle, ssid_key);
            (void)nvs_erase_key(nvs_handle, password_key);
        }
        ret = nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "SsidManager Clear failed: %s", esp_err_to_name(ret));
        }
    }

    esp_err_t AddSsid(const std::string& ssid, const std::string& password)
    {
        nvs_handle_t nvs_handle = 0;
        esp_err_t ret = nvs_open("wifi", NVS_READWRITE, &nvs_handle);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "SsidManager AddSsid open wifi failed: %s", esp_err_to_name(ret));
            return ret;
        }

        ret = nvs_set_str(nvs_handle, "ssid", ssid.c_str());
        if (ret == ESP_OK) {
            ret = nvs_set_str(nvs_handle, "password", password.c_str());
        }
        if (ret == ESP_OK) {
            ret = nvs_commit(nvs_handle);
        }
        nvs_close(nvs_handle);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "SsidManager AddSsid failed: %s", esp_err_to_name(ret));
        }
        return ret;
    }
};

class WifiConfigurationAp {
public:
    static WifiConfigurationAp& GetInstance()
    {
        static WifiConfigurationAp instance;
        return instance;
    }

    esp_err_t Save(const std::string& ssid, const std::string& password)
    {
        esp_err_t wifi_ret = SsidManager::GetInstance().AddSsid(ssid, password);
        esp_err_t sta_ret = save_wifi_config_to_nvs(ssid.c_str(), password.c_str());
        return wifi_ret != ESP_OK ? wifi_ret : sta_ret;
    }
};

static TaskHandle_t s_wifi_connect_task = NULL;
static json_sender_t s_wifi_connect_reply_sender = NULL;
static bool s_wifi_connect_notify_result = false;
static const char *s_wifi_connect_result_func = NULL;
static bool s_wifi_connect_force_reconnect = false;

static bool notify_wifi_info_if_ip_ready(json_sender_t reply_sender,
                                         const char *reason,
                                         bool allow_recheck,
                                         bool *ip_ready_out)
{
    server_network_sta_status_t status = {};

    if (ip_ready_out != NULL) {
        *ip_ready_out = false;
    }

    if (reply_sender == NULL) {
        ESP_LOGE(TAG, "wifi_info_result notify skipped reason=%s sender=NULL",
                 reason != NULL ? reason : "<null>");
        return false;
    }

    s_active_send_json = reply_sender;
    if (ServerNetworkSta_GetStatus(&status) != ESP_OK) {
        ESP_LOGE(TAG, "wifi_info_result notify status read failed reason=%s",
                 reason != NULL ? reason : "<null>");
        return false;
    }

    for (int recheck = 1;
         (status.state != SERVER_NETWORK_STA_STATE_GOT_IP || status.ip[0] == '\0') &&
         allow_recheck &&
         recheck <= WIFI_INFO_IP_READY_RECHECK_COUNT;
         recheck++) {
        ESP_LOGW(TAG,
                 "wifi_info_result notify waiting for IP reason=%s state=%d last=%d ip=%s recheck=%d/%d",
                 reason != NULL ? reason : "<null>",
                 (int)status.state,
                 status.last_result,
                 status.ip[0] != '\0' ? status.ip : "<empty>",
                 recheck,
                 WIFI_INFO_IP_READY_RECHECK_COUNT);
        vTaskDelay(pdMS_TO_TICKS(WIFI_INFO_IP_READY_RECHECK_DELAY_MS));
        memset(&status, 0, sizeof(status));
        if (ServerNetworkSta_GetStatus(&status) != ESP_OK) {
            ESP_LOGE(TAG, "wifi_info_result notify status reread failed reason=%s recheck=%d/%d",
                     reason != NULL ? reason : "<null>",
                     recheck,
                     WIFI_INFO_IP_READY_RECHECK_COUNT);
            return false;
        }
    }

    if (status.state == SERVER_NETWORK_STA_STATE_GOT_IP && status.ip[0] != '\0') {
        if (ip_ready_out != NULL) {
            *ip_ready_out = true;
        }
        ESP_LOGI(TAG, "wifi_info_result notify call send_base_info reason=%s ip=%s",
                 reason != NULL ? reason : "<null>",
                 status.ip);
        return send_base_info_to_mobile();
    }

    ESP_LOGW(TAG,
             "wifi_info_result notify no IP reason=%s state=%d last=%d ip=%s",
             reason != NULL ? reason : "<null>",
             (int)status.state,
             status.last_result,
             status.ip[0] != '\0' ? status.ip : "<empty>");
    return false;
}

