tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
static void wifi_connect_task(void *arg)
{
    (void)arg;
    bool force_reconnect = s_wifi_connect_force_reconnect;
    uint8_t init_result = force_reconnect
                              ? ::User_Network_mode_app_init_force("/data")
                              : ::User_Network_mode_app_init("/data");
    int connect_result = ServerNetworkSta_GetLastConnectResult();
    ESP_LOGI(TAG, "BLE/CH583 WiFi connect task finished init=%u connect_result=%d",
             (unsigned int)init_result,
             connect_result);
    json_sender_t reply_sender = s_wifi_connect_reply_sender;
    bool notify_result = s_wifi_connect_notify_result;
    const char *result_func = s_wifi_connect_result_func != NULL
                                  ? s_wifi_connect_result_func
                                  : "wifi_wakeup_result";
    s_wifi_connect_reply_sender = NULL;
    s_wifi_connect_notify_result = false;
    s_wifi_connect_result_func = NULL;
    s_wifi_connect_force_reconnect = false;
    if (notify_result && reply_sender != NULL) {
        if (connect_result == TDX_JSON_RESULT_OK) {
            bool ip_ready = false;
            if (!notify_wifi_info_if_ip_ready(reply_sender, "wifi_connect_task", true, &ip_ready)) {
                if (ip_ready) {
                    ESP_LOGE(TAG, "WiFi got IP but wifi_info_result send failed");
                } else {
                    ESP_LOGW(TAG, "WiFi connect result OK but IP was not ready for wifi_info_result");
                    send_simple_result_with_sender(reply_sender,
                                                   result_func,
                                                   TDX_JSON_RESULT_WIFI_GOT_IP_FAILED,
                                                   "WiFi did not obtain IP");
                }
            }
        } else if (connect_result == TDX_JSON_RESULT_WIFI_AUTH_FAILED) {
            send_simple_result_with_sender(reply_sender,
                                           result_func,
                                           TDX_JSON_RESULT_WIFI_AUTH_FAILED,
                                           "WiFi authentication failed");
        } else if (connect_result == TDX_JSON_RESULT_WIFI_GOT_IP_FAILED) {
            send_simple_result_with_sender(reply_sender,
                                           result_func,
                                           TDX_JSON_RESULT_WIFI_GOT_IP_FAILED,
                                           "WiFi did not obtain IP");
        } else {
            send_simple_result_with_sender(reply_sender,
                                           result_func,
                                           TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT,
                                           "WiFi connect timed out");
        }
    } else {
        ESP_LOGW(TAG, "WiFi connect task finished without notify sender notify=%d sender_set=%d result=%d",
                 notify_result ? 1 : 0,
                 reply_sender != NULL ? 1 : 0,
                 connect_result);
    }
    WiFi_config_from_ch583 = false;
    WiFi_config_from_ble = false;
    s_wifi_connect_task = NULL;
    vTaskDelete(NULL);
}

static esp_err_t submit_wifi_connect(json_sender_t reply_sender,
                                     bool notify_result,
                                     const char *result_func,
                                     bool force_reconnect)
{
    if (s_wifi_connect_task != NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    s_wifi_connect_reply_sender = reply_sender;
    s_wifi_connect_notify_result = notify_result;
    s_wifi_connect_result_func = result_func;
    s_wifi_connect_force_reconnect = force_reconnect;
    if (xTaskCreate(wifi_connect_task,
                    "ble_wifi_connect",
                    6144,
                    NULL,
                    4,
                    &s_wifi_connect_task) != pdPASS) {
        s_wifi_connect_reply_sender = NULL;
        s_wifi_connect_notify_result = false;
        s_wifi_connect_result_func = NULL;
        s_wifi_connect_force_reconnect = false;
        return ESP_ERR_NO_MEM;
    }
    return ESP_OK;
}

int parse_wifi_config_json(const char *json_str, wifi_config_json_t *out)
{
    cJSON *root = NULL;
    cJSON *item_func = NULL;
    cJSON *item_ssid = NULL;
    cJSON *item_key = NULL;
    char reply_json[160];

    if (json_str == NULL || out == NULL) {
        LOG_ERROR("Invalid parameter");
        return -1;
    }

    /* 涓枃娉ㄩ噴锛?      鍏堟竻绌鸿緭鍑虹粨鏋勪綋锛岄伩鍏嶆畫鐣欐棫鏁版嵁    */
    memset(out, 0, sizeof(*out));

    root = cJSON_Parse(json_str);
    if (root == NULL) {
                LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

    item_func = cJSON_GetObjectItem(root, "func");
    item_ssid = cJSON_GetObjectItem(root, "ssid");
    item_key = cJSON_GetObjectItem(root, "key");

    /* 涓枃娉ㄩ噴锛?      妫€鏌ュ瓧娈垫槸鍚﹀瓨鍦ㄤ笖鏄瓧绗︿覆    */

    if (!cJSON_IsString(item_func) || item_func->valuestring == NULL ||
        !cJSON_IsString(item_ssid) || item_ssid->valuestring == NULL ||
        !cJSON_IsString(item_key) || item_key->valuestring == NULL) {
        cJSON_Delete(root);
                LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

    /* 涓枃娉ㄩ噴锛?
       瀹夊叏鎷疯礉鍒拌緭鍑虹粨鏋勪綋
    */
    snprintf(out->func, sizeof(out->func), "%s", item_func->valuestring);
    snprintf(out->ssid, sizeof(out->ssid), "%s", item_ssid->valuestring);
    snprintf(out->key, sizeof(out->key), "%s", item_key->valuestring);

    cJSON_Delete(root);
    Bl_Data_Ready =1;

    // Keep this scope local; s_wifi_connect_task is the single BLE/CH583 BUSY guard.
    {
            if (s_wifi_connect_task != NULL) {
                send_simple_result_with_sender(s_active_send_json,
                                               "wifi_result",
                                               TDX_JSON_RESULT_BUSY,
                                               "WiFi connect already in progress");
                return 0;
            }
            auto& wifi_ap = WifiConfigurationAp::GetInstance();
            std::string wifi_ssid = out->ssid;
            std::string wifi_password = out->key;
            // 3. 鎶婄粨鏋勪綋鐨勫€煎杩?JSON            
            snprintf(reply_json, sizeof(reply_json),
                     "{\"func\":\"wifi_result\",\"result\":%d,\"message\":\"Find wifi\",\"stage\":\"%s\"}",
                     TDX_JSON_RESULT_OK,
                     wifi_cfg.ssid);

            #if(USER_BLE_ENABLE == 1)
             (void)reply_json;
            // 杈撳嚭缁撴灉
             UserDebugOutput_Printf("JSON:\n%s\n", reply_json);
            #else
             (void)reply_json;
            #endif

            UserDebugOutput_Printf("The Wifi info parsed ok, save to NVS\n\r");
            SsidManager::GetInstance().Clear();
            esp_err_t save_ret = wifi_ap.Save(wifi_ssid, wifi_password);
            if (save_ret != ESP_OK) {
                send_simple_result_with_sender(s_active_send_json,
                                               "wifi_result",
                                               TDX_JSON_RESULT_WIFI_SAVE_FAILED,
                                               "save WiFi config failed");
                return 0;
            }

            ServerNetworkSta_RequestProvisioning();
            esp_err_t submit_ret = submit_wifi_connect(s_active_send_json, true, "wifi_result", true);
            if (submit_ret != ESP_OK) {
                send_simple_result_with_sender(s_active_send_json,
                                               "wifi_result",
                                               submit_ret == ESP_ERR_INVALID_STATE
                                                   ? TDX_JSON_RESULT_BUSY
                                                   : TDX_JSON_RESULT_WIFI_CONNECT_SUBMIT_FAILED,
                                               "submit WiFi connect failed");
                return 0;
            }

            WiFi_config_net = true;
            Wifi_connect_OK = 1;
            send_simple_result_with_sender(s_active_send_json,
                                           "wifi_result",
                                           TDX_JSON_RESULT_OK,
                                           "WiFi config saved and connect submitted");

